{"url":"https://dev.to/jacktt/acid-in-postgres-6h8","slug":"acid-in-postgres","title":"ACID in Postgres","description":"ACID is a set of properties that ensure reliable transactions in a database system. It stands for...","body_markdown":"**ACID** is a set of properties that ensure reliable transactions in a database system. It stands for **Atomicity**, **Consistency**, **Isolation**, and **Durability**. PostgreSQL follwos these principles to maintain data integrity and reliability during transactions. Here’s a breakdown of each property and how PostgreSQL implements it:\n\n### 1. **Atomicity**\n**Definition:** Atomicity ensures that a transaction is treated as a single, indivisible unit of work. Either all operations within the transaction are completed successfully, or none are applied (if any part fails).\n\n**PostgreSQL Implementation:**\n- **Transaction Management:** PostgreSQL uses the `BEGIN`, `COMMIT`, and `ROLLBACK` statements to manage transactions. If a transaction encounters an error or an explicit `ROLLBACK` is issued, PostgreSQL rolls back all changes made during the transaction, ensuring atomicity.\n- **Write-Ahead Logging (WAL):** Changes are first written to the WAL before being applied to the actual database. This ensures that even if the system crashes during a transaction, PostgreSQL can use the WAL to recover to a consistent state.\n\n### 2. **Consistency**\n**Definition:** Consistency ensures that a transaction brings the database from one valid state to another, maintaining the integrity of the database. This means that any transaction should not violate database constraints or rules.\n\n**PostgreSQL Implementation:**\n- **Constraints:** PostgreSQL enforces constraints such as primary keys, foreign keys, and unique constraints to ensure data validity. If a transaction violates any constraint, it is rolled back.\n- **Triggers:** Custom triggers can be defined to enforce business rules and maintain data consistency beyond basic constraints.\n\n### 3. **Isolation**\n**Definition:** Isolation ensures that transactions are executed in such a way that they do not interfere with each other. Each transaction should execute as if it were the only transaction in the system, even if multiple transactions are occurring concurrently.\n\n**PostgreSQL Implementation:**\n- **MVCC (Multi-Version Concurrency Control):** PostgreSQL uses MVCC to provide transaction isolation. MVCC allows multiple transactions to read and write data concurrently without blocking each other, while ensuring that each transaction sees a consistent snapshot of the database.\n- **Isolation Levels:** PostgreSQL supports different isolation levels (Read Uncommitted, Read Committed, Repeatable Read, Serializable) that determine the degree of visibility and interaction between transactions.\n\n### 4. **Durability**\n**Definition:** Durability ensures that once a transaction has been committed, it will persist even in the case of a system failure. Committed data should not be lost or rolled back.\n\n**PostgreSQL Implementation:**\n- **Write-Ahead Logging (WAL):** PostgreSQL writes changes to the WAL before applying them to the database. This ensures that even if the system crashes, the WAL can be used to replay committed transactions and recover to the last consistent state.\n- **Checkpoints:** Periodic checkpoints are created to flush changes from the WAL to the disk. This minimizes the amount of WAL that needs to be replayed after a crash, improving recovery speed.\n\n## Summary\nIn summary, PostgreSQL ensures ACID properties through its transaction management system, constraints, MVCC for isolation, and WAL for durability. This robust implementation helps maintain the integrity and reliability of the database in various scenarios.\n\n![Image description](https://dev-to-uploads.s3.amazonaws.com/uploads/articles/3ur3l4div97kxhgprfvx.gif)\n\n## References\n- https://www.linkedin.com/posts/alexxubyte_systemdesign-coding-interviewtips-activity-7236038161733230592-TXmU\n","body_html":"\u003cp\u003e\u003cstrong\u003eACID\u003c/strong\u003e is a set of properties that ensure reliable transactions in a database system. It stands for \u003cstrong\u003eAtomicity\u003c/strong\u003e, \u003cstrong\u003eConsistency\u003c/strong\u003e, \u003cstrong\u003eIsolation\u003c/strong\u003e, and \u003cstrong\u003eDurability\u003c/strong\u003e. PostgreSQL follwos these principles to maintain data integrity and reliability during transactions. Here’s a breakdown of each property and how PostgreSQL implements it:\u003c/p\u003e\n\n\u003ch3\u003e\n  \u003ca name=\"1-atomicity\" href=\"#1-atomicity\"\u003e\n  \u003c/a\u003e\n  1. \u003cstrong\u003eAtomicity\u003c/strong\u003e\n\u003c/h3\u003e\n\n\u003cp\u003e\u003cstrong\u003eDefinition:\u003c/strong\u003e Atomicity ensures that a transaction is treated as a single, indivisible unit of work. Either all operations within the transaction are completed successfully, or none are applied (if any part fails).\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003ePostgreSQL Implementation:\u003c/strong\u003e\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eTransaction Management:\u003c/strong\u003e PostgreSQL uses the \u003ccode\u003eBEGIN\u003c/code\u003e, \u003ccode\u003eCOMMIT\u003c/code\u003e, and \u003ccode\u003eROLLBACK\u003c/code\u003e statements to manage transactions. If a transaction encounters an error or an explicit \u003ccode\u003eROLLBACK\u003c/code\u003e is issued, PostgreSQL rolls back all changes made during the transaction, ensuring atomicity.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eWrite-Ahead Logging (WAL):\u003c/strong\u003e Changes are first written to the WAL before being applied to the actual database. This ensures that even if the system crashes during a transaction, PostgreSQL can use the WAL to recover to a consistent state.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3\u003e\n  \u003ca name=\"2-consistency\" href=\"#2-consistency\"\u003e\n  \u003c/a\u003e\n  2. \u003cstrong\u003eConsistency\u003c/strong\u003e\n\u003c/h3\u003e\n\n\u003cp\u003e\u003cstrong\u003eDefinition:\u003c/strong\u003e Consistency ensures that a transaction brings the database from one valid state to another, maintaining the integrity of the database. This means that any transaction should not violate database constraints or rules.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003ePostgreSQL Implementation:\u003c/strong\u003e\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eConstraints:\u003c/strong\u003e PostgreSQL enforces constraints such as primary keys, foreign keys, and unique constraints to ensure data validity. If a transaction violates any constraint, it is rolled back.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eTriggers:\u003c/strong\u003e Custom triggers can be defined to enforce business rules and maintain data consistency beyond basic constraints.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3\u003e\n  \u003ca name=\"3-isolation\" href=\"#3-isolation\"\u003e\n  \u003c/a\u003e\n  3. \u003cstrong\u003eIsolation\u003c/strong\u003e\n\u003c/h3\u003e\n\n\u003cp\u003e\u003cstrong\u003eDefinition:\u003c/strong\u003e Isolation ensures that transactions are executed in such a way that they do not interfere with each other. Each transaction should execute as if it were the only transaction in the system, even if multiple transactions are occurring concurrently.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003ePostgreSQL Implementation:\u003c/strong\u003e\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eMVCC (Multi-Version Concurrency Control):\u003c/strong\u003e PostgreSQL uses MVCC to provide transaction isolation. MVCC allows multiple transactions to read and write data concurrently without blocking each other, while ensuring that each transaction sees a consistent snapshot of the database.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eIsolation Levels:\u003c/strong\u003e PostgreSQL supports different isolation levels (Read Uncommitted, Read Committed, Repeatable Read, Serializable) that determine the degree of visibility and interaction between transactions.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3\u003e\n  \u003ca name=\"4-durability\" href=\"#4-durability\"\u003e\n  \u003c/a\u003e\n  4. \u003cstrong\u003eDurability\u003c/strong\u003e\n\u003c/h3\u003e\n\n\u003cp\u003e\u003cstrong\u003eDefinition:\u003c/strong\u003e Durability ensures that once a transaction has been committed, it will persist even in the case of a system failure. Committed data should not be lost or rolled back.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003ePostgreSQL Implementation:\u003c/strong\u003e\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003e\n\u003cstrong\u003eWrite-Ahead Logging (WAL):\u003c/strong\u003e PostgreSQL writes changes to the WAL before applying them to the database. This ensures that even if the system crashes, the WAL can be used to replay committed transactions and recover to the last consistent state.\u003c/li\u003e\n\u003cli\u003e\n\u003cstrong\u003eCheckpoints:\u003c/strong\u003e Periodic checkpoints are created to flush changes from the WAL to the disk. This minimizes the amount of WAL that needs to be replayed after a crash, improving recovery speed.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch2\u003e\n  \u003ca name=\"summary\" href=\"#summary\"\u003e\n  \u003c/a\u003e\n  Summary\n\u003c/h2\u003e\n\n\u003cp\u003eIn summary, PostgreSQL ensures ACID properties through its transaction management system, constraints, MVCC for isolation, and WAL for durability. This robust implementation helps maintain the integrity and reliability of the database in various scenarios.\u003c/p\u003e\n\n\u003cp\u003e\u003ca href=\"https://media.dev.to/cdn-cgi/image/width=800%2Cheight=%2Cfit=scale-down%2Cgravity=auto%2Cformat=auto/https%3A%2F%2Fdev-to-uploads.s3.amazonaws.com%2Fuploads%2Farticles%2F3ur3l4div97kxhgprfvx.gif\" class=\"article-body-image-wrapper\"\u003e\u003cimg src=\"https://media.dev.to/cdn-cgi/image/width=800%2Cheight=%2Cfit=scale-down%2Cgravity=auto%2Cformat=auto/https%3A%2F%2Fdev-to-uploads.s3.amazonaws.com%2Fuploads%2Farticles%2F3ur3l4div97kxhgprfvx.gif\" alt=\"Image description\" loading=\"lazy\" width=\"800\" height=\"1040\" data-animated=\"true\"\u003e\u003c/a\u003e\u003c/p\u003e\n\n\u003ch2\u003e\n  \u003ca name=\"references\" href=\"#references\"\u003e\n  \u003c/a\u003e\n  References\n\u003c/h2\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003ca href=\"https://www.linkedin.com/posts/alexxubyte_systemdesign-coding-interviewtips-activity-7236038161733230592-TXmU\" target=\"_blank\" rel=\"noopener noreferrer\"\u003ehttps://www.linkedin.com/posts/alexxubyte_systemdesign-coding-interviewtips-activity-7236038161733230592-TXmU\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n","thumbnail":"https://media.dev.to/cdn-cgi/image/width=1000,height=420,fit=cover,gravity=auto,format=auto/https%3A%2F%2Fdev-to-uploads.s3.amazonaws.com%2Fuploads%2Farticles%2F3uxjgm8eik6pm9pps6o5.jpg","author":{"id":"jacktt","name":"JackTT"},"created_at":"2024-08-15T14:51:43Z","updated_at":null,"tags":[]}